Tekla Open API Reference for Tekla Structures 2025
Integer Properties
The Integer type exposes the following members.
Properties
Name | Description
Value
 The value of the integer datatype.
Top
See Also
Reference
Integer Structure
Tekla.Structures.Datatype Namespace